InformationRegisters/ДанныеПроекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДанныеПроекта</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Код_в_PDM</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ЗапускВРаботу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗапускВРаботу</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВедущийКонструкторДатаПодписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВедущийКонструкторПодписьАвтор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДизайнерДатаПодписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДизайнерПодписьАвтор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументЗакрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ПодготовкаПроекта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Комплекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комплект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СофтПКД</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Софт</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СофтРКД</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Софт</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/омПроекты/Ext/Module.bsl
Функция ПодписьСделки(Сделка) Экспорт

	стВозврата = Новый Структура("АвторПодписи,ДатаПодписи",Справочники.Пользователи.ПустаяСсылка(),Дата(1,1,1));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВЫБОР
		|		КОГДА ЗапускВРаботу.ДизайнерДатаПодписи > ЗапускВРаботу.ВедущийКонструкторДатаПодписи
		|			ТОГДА ЗапускВРаботу.ВедущийКонструкторДатаПодписи
		|		ИНАЧЕ ЗапускВРаботу.ДизайнерДатаПодписи
		|	КОНЕЦ КАК ДатаПодписи,
		|	ВЫБОР
		|		КОГДА ЗапускВРаботу.ДизайнерДатаПодписи > ЗапускВРаботу.ВедущийКонструкторДатаПодписи
		|			ТОГДА ЗапускВРаботу.ДизайнерПодписьАвтор
		|		ИНАЧЕ ЗапускВРаботу.ВедущийКонструкторПодписьАвтор
		|	КОНЕЦ КАК АвторПодписи
		|ИЗ
		|	Документ.ЗапускВРаботу КАК ЗапускВРаботу
		|ГДЕ
		|	ЗапускВРаботу.Проект = &Проект
		|	И НЕ ЗапускВРаботу.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаПодписи";
	
	Запрос.УстановитьПараметр("Проект", Сделка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(стВозврата, Выборка);
	КонецЦикла;
	
	Возврат стВозврата;
	
КонецФункции // ПодписьСделки()

Процедура УстановитьКодПДМДляСделки(ПараметрСделка, КодВПДМ) Экспорт

	
	Если ТипЗнч(ПараметрСделка) = Тип("Строка") Тогда
		Сделка = Справочники.Проекты.НайтиПоКоду(ПараметрСделка);
	Иначе
		Сделка = ПараметрСделка;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Сделка) Тогда
	
		МенеджерЗаписей 		= РегистрыСведений.ДанныеПроекта.СоздатьМенеджерЗаписи();
		МенеджерЗаписей.Проект 	= Сделка;
		
		МенеджерЗаписей.Прочитать();
		
		Если ЗначениеЗаполнено(МенеджерЗаписей.Проект) Тогда
			
			Если НЕ МенеджерЗаписей.Код_в_PDM = КодВПДМ Тогда
				
				МенеджерЗаписей.Код_в_PDM = КодВПДМ;
				МенеджерЗаписей.Записать();
				
			КонецЕсли;
			
		Иначе
			
			МенеджерЗаписей.Проект 	= Сделка;
			МенеджерЗаписей.Код_в_PDM = КодВПДМ;
			
			МенеджерЗаписей.Записать();
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры // УстановитьКодПДМДляСделки()
